SynapseAviationApp.Server/Models/GetExchangeRateRequestModel.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<GetExchangeRate xmlns="https://www.nbrm.mk/klservice/">
			<StartDate>{[StartDateValue]}</StartDate>
			<EndDate>{[EndDateValue]}</EndDate>
		</GetExchangeRate>
	</soap:Body>
</soap:Envelope>